const Yup = require("yup");

exports.schema = Yup.object().shape({
  title: Yup.string()
    .required("عنوان الزامی است")
    .min(5, "عنوان نباید کمتر از 5 کاراکتر باشد")
    .max(100, "عنوان نباید بیشتر از 100 کاراکتر باشد"),
  body: Yup.string()
    .min(10, "توضیحات نباید کمتر از 10 کاراکتر باشد")
    .max(255, "توضیحات نباید بیشتر از 255 کاراکتر باشد")
    .required("توضیحات الزامی می باشد"),
  status: Yup.mixed().oneOf(
    ["خصوصی", "عمومی"],
    "یا عمومی و یا خصوصی را انتخاب کنید"
  ),
});
